# Pandas
- table-shape 2-D arrays
- DataFrame, Series
- usefull functions

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
dic1 = {'city':['seoul'],
       'year': ['2017'],
       'temperature': [25.2]}

dic1

{'city': ['seoul'], 'year': ['2017'], 'temperature': [25.2]}

In [3]:
dic2 = {'city':['seoul','busan', 'incheon', 'daejun', 'kwangju'],
       'year': ['2017', '2019','2018','2020','2020'],
       'temperature': [25.2, 27, 24.3, 25.4, 26.8]}

dic2

{'city': ['seoul', 'busan', 'incheon', 'daejun', 'kwangju'],
 'year': ['2017', '2019', '2018', '2020', '2020'],
 'temperature': [25.2, 27, 24.3, 25.4, 26.8]}

In [4]:
df = pd.DataFrame(dic2)
df

      city  year  temperature
0    seoul  2017         25.2
1    busan  2019         27.0
2  incheon  2018         24.3
3   daejun  2020         25.4
4  kwangju  2020         26.8

In [5]:
pd.Series(dic1)

city           [seoul]
year            [2017]
temperature     [25.2]
dtype: object

In [6]:
pd.DataFrame(dic1)

    city  year  temperature
0  seoul  2017         25.2

In [7]:
df.columns, df.index, df.values # array로 만들어줌

(Index(['city', 'year', 'temperature'], dtype='object'),
 RangeIndex(start=0, stop=5, step=1),
 array([['seoul', '2017', 25.2],
        ['busan', '2019', 27.0],
        ['incheon', '2018', 24.3],
        ['daejun', '2020', 25.4],
        ['kwangju', '2020', 26.8]], dtype=object))

In [8]:
df['city'] # pd.Sereis type을 보여준다

0      seoul
1      busan
2    incheon
3     daejun
4    kwangju
Name: city, dtype: object

In [9]:
df.city

0      seoul
1      busan
2    incheon
3     daejun
4    kwangju
Name: city, dtype: object

In [10]:
# 여러 개를 보고 싶을 때
df[['city', 'year']]

      city  year
0    seoul  2017
1    busan  2019
2  incheon  2018
3   daejun  2020
4  kwangju  2020

In [11]:
df.index = [x for x in range(0,10,2)]
df

      city  year  temperature
0    seoul  2017         25.2
2    busan  2019         27.0
4  incheon  2018         24.3
6   daejun  2020         25.4
8  kwangju  2020         26.8

In [12]:
df.set_index('city') # index가 city가 된 것

         year  temperature
city
seoul    2017         25.2
busan    2019         27.0
incheon  2018         24.3
daejun   2020         25.4
kwangju  2020         26.8

In [13]:
df.index = ['a','b','c','d','e']; df

      city  year  temperature
a    seoul  2017         25.2
b    busan  2019         27.0
c  incheon  2018         24.3
d   daejun  2020         25.4
e  kwangju  2020         26.8

In [14]:
df.loc[['c','d']].temperature # row 접근할 때는 loc 을 이용해 접근

c    24.3
d    25.4
Name: temperature, dtype: float64

In [15]:
df.loc['b':'d'] # slicing 가능 (끝 부분이 include 되는 것이 특징)

      city  year  temperature
b    busan  2019         27.0
c  incheon  2018         24.3
d   daejun  2020         25.4

In [16]:
# index location: index를 이용해 접근 가능
df.iloc[0]

city           seoul
year            2017
temperature     25.2
Name: a, dtype: object

In [17]:
df.iloc[1:4] # slicing 할 때 똑같음

      city  year  temperature
b    busan  2019         27.0
c  incheon  2018         24.3
d   daejun  2020         25.4

In [18]:
# inplace function 으로 동작함
df['pop'] = [1000,350,300,150,120]

In [19]:
# 2D 데이터를 다룰 때 편한 것 중 하나가 row, column 삭제가 편함
df

      city  year  temperature   pop
a    seoul  2017         25.2  1000
b    busan  2019         27.0   350
c  incheon  2018         24.3   300
d   daejun  2020         25.4   150
e  kwangju  2020         26.8   120

In [20]:
# row를 없앰
df.drop(['d','e'])

      city  year  temperature   pop
a    seoul  2017         25.2  1000
b    busan  2019         27.0   350
c  incheon  2018         24.3   300

In [21]:
# columns 을 없앰
df.drop(['temperature'], axis=1)

      city  year   pop
a    seoul  2017  1000
b    busan  2019   350
c  incheon  2018   300
d   daejun  2020   150
e  kwangju  2020   120

In [22]:
df = pd.DataFrame(np.arange(12).reshape(3,4),
                  columns = ['A','B','C','D'],
                  index = ['a','b','c'])
df

   A  B   C   D
a  0  1   2   3
b  4  5   6   7
c  8  9  10  11

In [23]:
# sum
df.sum() # column(features) 별로 뽑아냄
df.sum(axis=1) # row 별로 뽑아냄

a     6
b    22
c    38
dtype: int64

In [24]:
# max
df.max()
df.max(axis = 1)

a     3
b     7
c    11
dtype: int32

In [25]:
arr = df.values; arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [26]:
# lambda function (1회성 함수)
f = lambda x: 2*x.max() - x.min()
df.apply(f)

A    16
B    17
C    18
D    19
dtype: int64

In [27]:
# sorting

ser = pd.Series(np.arange(4), index=['d','a','b','c'])
ser

d    0
a    1
b    2
c    3
dtype: int32

In [28]:
# index를 가지고 sorting
ser.sort_index()

a    1
b    2
c    3
d    0
dtype: int32

In [29]:
# values를 가지고 sorting
ser.sort_values()

d    0
a    1
b    2
c    3
dtype: int32

In [30]:
ser.sort_values(ascending=False)

c    3
b    2
a    1
d    0
dtype: int32

In [31]:
df.index = ['c','a','b']

In [32]:
df.sort_index()

   A  B   C   D
a  4  5   6   7
b  8  9  10  11
c  0  1   2   3

In [33]:
df.sort_index(ascending=False)

   A  B   C   D
c  0  1   2   3
b  8  9  10  11
a  4  5   6   7

In [34]:
df.sort_index(axis=1, ascending = False)

    D   C  B  A
c   3   2  1  0
a   7   6  5  4
b  11  10  9  8

In [35]:
df.sort_values(by='C', ascending=False)

   A  B   C   D
b  8  9  10  11
a  4  5   6   7
c  0  1   2   3

In [36]:
# argsort(정렬된 순서 나타내 줌)
arr2 = arr[::-1,::-1]
arr2.argsort()

array([[3, 2, 1, 0],
       [3, 2, 1, 0],
       [3, 2, 1, 0]], dtype=int64)

In [37]:
# rank
ser2 = pd.Series([100,23,99,33,99])
ser2

0    100
1     23
2     99
3     33
4     99
dtype: int64

In [38]:
ser2.rank(ascending = False) # 순위를 정해주는 것

0    1.0
1    5.0
2    2.5
3    4.0
4    2.5
dtype: float64

In [39]:
ser2.rank(ascending = False, method = 'first') # 먼저 나온 것 높은 순서

0    1.0
1    5.0
2    2.0
3    4.0
4    3.0
dtype: float64

## DataFrame 합치기!! 너무 중요!!

In [40]:
df2 = pd.DataFrame({
    'b':[4,7,3,2],
    'a':[4,9,2,5],
    'c':[5,3,7,9]})

df2

   b  a  c
0  4  4  5
1  7  9  3
2  3  2  7
3  2  5  9

In [41]:
df2.rank() # 똑같이 feature에 대해서 등 수 먹임

     b    a    c
0  3.0  2.0  2.0
1  4.0  4.0  1.0
2  2.0  1.0  3.0
3  1.0  3.0  4.0

In [42]:
df2.rank(axis = 1)

     b    a    c
0  1.5  1.5  3.0
1  2.0  3.0  1.0
2  2.0  1.0  3.0
3  1.0  2.0  3.0

In [43]:
df3 = pd.DataFrame({
    'b':[4,7,3,2],
    'a':[4,9,2,5],
    'c':[5,3,7,np.nan]})

df3

   b  a    c
0  4  4  5.0
1  7  9  3.0
2  3  2  7.0
3  2  5  NaN

In [44]:
df3.sum(), df3.mean() # not a number 를 무시함

(b    16.0
 a    20.0
 c    15.0
 dtype: float64, b    4.0
 a    5.0
 c    5.0
 dtype: float64)

In [45]:
df3.sum(skipna=False) # not a number 를 무시하지 않음

b    16.0
a    20.0
c     NaN
dtype: float64

In [46]:
df3.idxmax() # max 인 index를 찾아주는 것

b    1
a    1
c    2
dtype: int64

In [47]:
df3.idxmin()

b    3
a    2
c    1
dtype: int64

In [48]:
ser3 = pd.Series(['c','a','d','a','b','a','c','c'])
ser3

0    c
1    a
2    d
3    a
4    b
5    a
6    c
7    c
dtype: object

### 중복제거 (unique() 와 set)

In [49]:
uq = ser3.unique()
uq.sort()
uq

array(['a', 'b', 'c', 'd'], dtype=object)

In [50]:
set(ser3)

{'a', 'b', 'c', 'd'}

In [51]:
# 몇 개씩 있는지 가르쳐 줌
ser3.value_counts()

a    3
c    3
d    1
b    1
dtype: int64

In [52]:
df = pd.DataFrame({'x': ['c','a','c','a','a','b','b','c','c'],
                   'y': ['f','g','d','g','h','e','d','h','f'],
                   'z': ['a','e','d','g','d','e','q','b','c']})
df

   x  y  z
0  c  f  a
1  a  g  e
2  c  d  d
3  a  g  g
4  a  h  d
5  b  e  e
6  b  d  q
7  c  h  b
8  c  f  c

In [53]:
df.apply(lambda s: s.value_counts()) # 각 feature 별로 원소들이 몇 개 있는지 뽑아줌

     x    y    z
a  3.0  NaN  1.0
b  2.0  NaN  1.0
c  4.0  NaN  1.0
d  NaN  2.0  2.0
e  NaN  1.0  2.0
f  NaN  2.0  NaN
g  NaN  2.0  1.0
h  NaN  2.0  NaN
q  NaN  NaN  1.0

In [54]:
result = df.apply(pd.value_counts)

In [55]:
result.dropna() # Not a Number 가 있는 경우(missing values) 지움

Empty DataFrame
Columns: [x, y, z]
Index: []

In [56]:
result.dropna(axis=1) # 모든 feature 들이 없어짐

Empty DataFrame
Columns: []
Index: [a, b, c, d, e, f, g, h, q]

In [57]:
# Not a nunmber 값 대체
result.fillna({'x':0, 'y':1,'z':999})

     x    y      z
a  3.0  1.0    1.0
b  2.0  1.0    1.0
c  4.0  1.0    1.0
d  0.0  2.0    2.0
e  0.0  1.0    2.0
f  0.0  2.0  999.0
g  0.0  2.0    1.0
h  0.0  2.0  999.0
q  0.0  1.0    1.0

In [72]:
result.dropna(thresh=2) # 1있는 것은 남겨놓음, 2개 이상 부터 지움, row 기준

     x    y    z
a  3.0  NaN  1.0
b  2.0  NaN  1.0
c  4.0  NaN  1.0
d  NaN  2.0  2.0
e  NaN  1.0  2.0
g  NaN  2.0  1.0

In [59]:
# concatenation

df1= pd.DataFrame(np.arange(12).reshape(3,4))
df1

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [60]:
df2 = pd.DataFrame(np.ones((3,4)))
df2

     0    1    2    3
0  1.0  1.0  1.0  1.0
1  1.0  1.0  1.0  1.0
2  1.0  1.0  1.0  1.0

In [61]:
pd.concat([df1,df2])

     0    1     2     3
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0
0  1.0  1.0   1.0   1.0
1  1.0  1.0   1.0   1.0
2  1.0  1.0   1.0   1.0

In [62]:
pd.concat([df1,df2], axis=1)

   0  1   2   3    0    1    2    3
0  0  1   2   3  1.0  1.0  1.0  1.0
1  4  5   6   7  1.0  1.0  1.0  1.0
2  8  9  10  11  1.0  1.0  1.0  1.0

In [63]:
# merge

df3 = pd.DataFrame({'cus_no':[1001,1002,1003,1004],
                   'name':['choi', 'kim', 'park', 'hur']})
df3

   cus_no  name
0    1001  choi
1    1002   kim
2    1003  park
3    1004   hur

In [64]:
df4 = pd.DataFrame({'cus_no':[1001,1002,1003,1004],
                   'amount':[10000, 20000, 50000, 6000]})
df4

   cus_no  amount
0    1001   10000
1    1002   20000
2    1003   50000
3    1004    6000

In [65]:
pd.concat([df3,df4])

C:\Users\CheolHwang\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

    amount  cus_no  name
0      NaN    1001  choi
1      NaN    1002   kim
2      NaN    1003  park
3      NaN    1004   hur
0  10000.0    1001   NaN
1  20000.0    1002   NaN
2  50000.0    1003   NaN
3   6000.0    1004   NaN

In [66]:
pd.concat([df3,df4],axis=1)

   cus_no  name  cus_no  amount
0    1001  choi    1001   10000
1    1002   kim    1002   20000
2    1003  park    1003   50000
3    1004   hur    1004    6000

In [67]:
pd.merge(df3,df4) # 하나의 field 는 같기 때문에 조정해줌

   cus_no  name  amount
0    1001  choi   10000
1    1002   kim   20000
2    1003  park   50000
3    1004   hur    6000

In [68]:
df5 = pd.DataFrame({'cus_no':[1001,1001,1003,1006],
                   'amount':[10000, 20000, 50000, 6000]})
df5

   cus_no  amount
0    1001   10000
1    1001   20000
2    1003   50000
3    1006    6000

In [69]:
pd.merge(df3, df5) # 서로 다를 때, 합쳐줄 수 있는 것들만 함쳐줌

   cus_no  name  amount
0    1001  choi   10000
1    1001  choi   20000
2    1003  park   50000

In [70]:
pd.merge(df3, df5, how='outer') # 해당되지 않는 부분은 not a number 로 만들어줌

   cus_no  name   amount
0    1001  choi  10000.0
1    1001  choi  20000.0
2    1002   kim      NaN
3    1003  park  50000.0
4    1004   hur      NaN
5    1006   NaN   6000.0